Revit 2024 API
FabricArea.HostId Property
 The id of the Host element for the fabric area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId HostId { get; }
Visual Basic
Public ReadOnly Property HostId As ElementId
	Get
Visual C++
public:
property ElementId^ HostId {
	ElementId^ get ();
}
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace